#include <iostream>
#include <clocale>
#include "Progression.h"

using namespace std;

int main()
{
    setlocale(LC_ALL, "RU");
    cout << "============================================================================================" << endl;
    cout << "\t\tЛабораторная работа по классам 1. Реализация работы программы." << endl;
    cout << "============================================================================================" << endl;

    cout << "\n------------------------------------------------------------------------------------------" << endl;
    cout << "Инициализация объекта через метод Init." << endl;
    Progression progres_1;
    int num, num2;
    progres_1.Init(5.3, 2);
    progres_1.Show();
    cout << "Введите номер элемента в последовательности, который хотите найти: ";
    cin >> num;
    cout << num << "-ый элемент последовательности равен " << progres_1.Element(num) << endl;
    cout << "------------------------------------------------------------------------------------------" << endl;

    cout << "\n------------------------------------------------------------------------------------------" << endl;
    cout << "Инициализация объекта через метод Read." << endl;
    Progression progres_2;
    progres_2.Read();
    cout << "Введите номер элемента в последовательности, который хотите найти: ";
    cin >> num2;
    cout << num2 << "-ый элемент последовательности равен " << progres_2.Element(num2) << endl;
    cout << "------------------------------------------------------------------------------------------" << endl;

    //cout << "\n------------------------------------------------------------------------------------------" << endl;
    //cout << "Инициализация объекта через функцию make_progression." << endl;
    //Progression progres_3 = make_progression(5.3, 2);
    //progres_3.Show();
    //cout << num << "-ый элемент последовательности равен " << progres_3.Element(num) << endl;
    //cout << "------------------------------------------------------------------------------------------" << endl;

    return 0;
}
